var movie = [    
    // {
    //     "id": 0,
    //     "name": "",
    //     "detail": "",
    //     "poster": "",
    //     "tailer": "",
    //     "time": "",
    //     "director": "",
    //     "status": "coming soon"
    // },
    {
        "id": 1,
        "name": "The BFG(1)",
        "detail": "จากวรรณกรรมเยาวชนชื่อดังตั้งแต่ปี 1982 ของ “โรอัลด์ ดาห์ล” ที่ได้รับการตีพิมพ์เป็นภาษาต่างๆ มาแล้วทั่วโลก รวมทั้งไทย ในชื่อ “ยักษ์ใจดี” สู่ภาพยนตร์ผจญภัยแฟนตาซี โดยผู้กำกับ “สตีเว่น สปีลเบิร์ก” ว่าด้วยเรื่องราวเหนือจินตนาการของเด็กหญิงคนหนึ่งในคืนหฤหรรษ์ เมื่อคำเตือนที่ถูกบอกเล่ากลายเป็นเรื่องจริง และเธอได้พบกับประสบการณ์เหลือเชื่อกับเพื่อนตัวยักษ์ต่างวัย ก่อเกิดเป็นมิตรภาพต่างไซส์ ผ่านการถ่ายทอดเรื่องราวจากดิสนีย์\n\nสำหรับคำว่า The BFG ที่ว่านี้ ย่อมาจาก “The Big Friendly” ซึ่งดูจะเป็นการนิยามที่สอดคล้องกับมิตรภาพที่เกิดขึ้นในเรื่องราวนี้อย่างชัดเจน โดยเรื่องราวการผจญภัยทั้งหมดนี้ ถูกถ่ายทอดผ่าน โซฟี เด็กหญิงบ้านเด็กกำพร้าวัย 10 ขวบ ที่ถูกยักษ์แก่ใจดีขนาด 24 ฟุต จับตัวไปยังเมืองยักษ์ ด้วยวัตถุประสงค์อะไรบางอย่าง ทั้งนี้การปรากฏตัวของเธอในสถานที่ไม่สมควรนี้ ได้ชักนำภัยจากเหล่ายักษ์ใจร้ายเข้าใกล้ตัวเธอและเมืองลอนดอนของมนุษย์มากยิ่งขึ้น จึงเป็นหน้าที่สองเพื่อนต่างไซส์ที่ต้องไปเตือนราชินีให้สำเร็จก่อนที่ทุกอย่างจะสายเกินไป…",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/The_BFG_poster.jpg/220px-The_BFG_poster.jpg",
        "trailer": "https://youtu.be/y1fZg0hhBX8",
        "type": "แฟนตาซี / ผจญภัย",
        "time": "117",
        "director": "Steven Spielberg",
        "status": "coming soon"
    },
    {
        "id": 2,
        "name": "The BFG(2)",
        "detail": "จากวรรณกรรมเยาวชนชื่อดังตั้งแต่ปี 1982 ของ “โรอัลด์ ดาห์ล” ที่ได้รับการตีพิมพ์เป็นภาษาต่างๆ มาแล้วทั่วโลก รวมทั้งไทย ในชื่อ “ยักษ์ใจดี” สู่ภาพยนตร์ผจญภัยแฟนตาซี โดยผู้กำกับ “สตีเว่น สปีลเบิร์ก” ว่าด้วยเรื่องราวเหนือจินตนาการของเด็กหญิงคนหนึ่งในคืนหฤหรรษ์ เมื่อคำเตือนที่ถูกบอกเล่ากลายเป็นเรื่องจริง และเธอได้พบกับประสบการณ์เหลือเชื่อกับเพื่อนตัวยักษ์ต่างวัย ก่อเกิดเป็นมิตรภาพต่างไซส์ ผ่านการถ่ายทอดเรื่องราวจากดิสนีย์\n\nสำหรับคำว่า The BFG ที่ว่านี้ ย่อมาจาก “The Big Friendly” ซึ่งดูจะเป็นการนิยามที่สอดคล้องกับมิตรภาพที่เกิดขึ้นในเรื่องราวนี้อย่างชัดเจน โดยเรื่องราวการผจญภัยทั้งหมดนี้ ถูกถ่ายทอดผ่าน โซฟี เด็กหญิงบ้านเด็กกำพร้าวัย 10 ขวบ ที่ถูกยักษ์แก่ใจดีขนาด 24 ฟุต จับตัวไปยังเมืองยักษ์ ด้วยวัตถุประสงค์อะไรบางอย่าง ทั้งนี้การปรากฏตัวของเธอในสถานที่ไม่สมควรนี้ ได้ชักนำภัยจากเหล่ายักษ์ใจร้ายเข้าใกล้ตัวเธอและเมืองลอนดอนของมนุษย์มากยิ่งขึ้น จึงเป็นหน้าที่สองเพื่อนต่างไซส์ที่ต้องไปเตือนราชินีให้สำเร็จก่อนที่ทุกอย่างจะสายเกินไป…",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/The_BFG_poster.jpg/220px-The_BFG_poster.jpg",
        "trailer": "https://youtu.be/y1fZg0hhBX8",
        "type": "แฟนตาซี / ผจญภัย",
        "time": "117",
        "director": "Steven Spielberg",
        "status": "show now"
    },
    {
        "id": 3,
        "name": "The BFG(3)",
        "detail": "จากวรรณกรรมเยาวชนชื่อดังตั้งแต่ปี 1982 ของ “โรอัลด์ ดาห์ล” ที่ได้รับการตีพิมพ์เป็นภาษาต่างๆ มาแล้วทั่วโลก รวมทั้งไทย ในชื่อ “ยักษ์ใจดี” สู่ภาพยนตร์ผจญภัยแฟนตาซี โดยผู้กำกับ “สตีเว่น สปีลเบิร์ก” ว่าด้วยเรื่องราวเหนือจินตนาการของเด็กหญิงคนหนึ่งในคืนหฤหรรษ์ เมื่อคำเตือนที่ถูกบอกเล่ากลายเป็นเรื่องจริง และเธอได้พบกับประสบการณ์เหลือเชื่อกับเพื่อนตัวยักษ์ต่างวัย ก่อเกิดเป็นมิตรภาพต่างไซส์ ผ่านการถ่ายทอดเรื่องราวจากดิสนีย์\n\nสำหรับคำว่า The BFG ที่ว่านี้ ย่อมาจาก “The Big Friendly” ซึ่งดูจะเป็นการนิยามที่สอดคล้องกับมิตรภาพที่เกิดขึ้นในเรื่องราวนี้อย่างชัดเจน โดยเรื่องราวการผจญภัยทั้งหมดนี้ ถูกถ่ายทอดผ่าน โซฟี เด็กหญิงบ้านเด็กกำพร้าวัย 10 ขวบ ที่ถูกยักษ์แก่ใจดีขนาด 24 ฟุต จับตัวไปยังเมืองยักษ์ ด้วยวัตถุประสงค์อะไรบางอย่าง ทั้งนี้การปรากฏตัวของเธอในสถานที่ไม่สมควรนี้ ได้ชักนำภัยจากเหล่ายักษ์ใจร้ายเข้าใกล้ตัวเธอและเมืองลอนดอนของมนุษย์มากยิ่งขึ้น จึงเป็นหน้าที่สองเพื่อนต่างไซส์ที่ต้องไปเตือนราชินีให้สำเร็จก่อนที่ทุกอย่างจะสายเกินไป…",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/The_BFG_poster.jpg/220px-The_BFG_poster.jpg",
        "trailer": "https://youtu.be/y1fZg0hhBX8",
        "type": "แฟนตาซี / ผจญภัย",
        "time": "117",
        "director": "Steven Spielberg",
        "status": "show now"
    },
    {
        "id": 4,
        "name": "The BFG(4)",
        "detail": "\tจากวรรณกรรมเยาวชนชื่อดังตั้งแต่ปี 1982 ของ “โรอัลด์ ดาห์ล” ที่ได้รับการตีพิมพ์เป็นภาษาต่างๆ มาแล้วทั่วโลก รวมทั้งไทย ในชื่อ “ยักษ์ใจดี” สู่ภาพยนตร์ผจญภัยแฟนตาซี โดยผู้กำกับ “สตีเว่น สปีลเบิร์ก” ว่าด้วยเรื่องราวเหนือจินตนาการของเด็กหญิงคนหนึ่งในคืนหฤหรรษ์ เมื่อคำเตือนที่ถูกบอกเล่ากลายเป็นเรื่องจริง และเธอได้พบกับประสบการณ์เหลือเชื่อกับเพื่อนตัวยักษ์ต่างวัย ก่อเกิดเป็นมิตรภาพต่างไซส์ ผ่านการถ่ายทอดเรื่องราวจากดิสนีย์\n\nสำหรับคำว่า The BFG ที่ว่านี้ ย่อมาจาก “The Big Friendly” ซึ่งดูจะเป็นการนิยามที่สอดคล้องกับมิตรภาพที่เกิดขึ้นในเรื่องราวนี้อย่างชัดเจน โดยเรื่องราวการผจญภัยทั้งหมดนี้ ถูกถ่ายทอดผ่าน โซฟี เด็กหญิงบ้านเด็กกำพร้าวัย 10 ขวบ ที่ถูกยักษ์แก่ใจดีขนาด 24 ฟุต จับตัวไปยังเมืองยักษ์ ด้วยวัตถุประสงค์อะไรบางอย่าง ทั้งนี้การปรากฏตัวของเธอในสถานที่ไม่สมควรนี้ ได้ชักนำภัยจากเหล่ายักษ์ใจร้ายเข้าใกล้ตัวเธอและเมืองลอนดอนของมนุษย์มากยิ่งขึ้น จึงเป็นหน้าที่สองเพื่อนต่างไซส์ที่ต้องไปเตือนราชินีให้สำเร็จก่อนที่ทุกอย่างจะสายเกินไป…",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/The_BFG_poster.jpg/220px-The_BFG_poster.jpg",
        "trailer": "https://youtu.be/y1fZg0hhBX8",
        "type": "แฟนตาซี / ผจญภัย",
        "time": "117",
        "director": "Steven Spielberg",
        "status": "show now"
    },
    {
        "id": 5,
        "name": "The BFG(5)",
        "detail": "จากวรรณกรรมเยาวชนชื่อดังตั้งแต่ปี 1982 ของ “โรอัลด์ ดาห์ล” ที่ได้รับการตีพิมพ์เป็นภาษาต่างๆ มาแล้วทั่วโลก รวมทั้งไทย ในชื่อ “ยักษ์ใจดี” สู่ภาพยนตร์ผจญภัยแฟนตาซี โดยผู้กำกับ “สตีเว่น สปีลเบิร์ก” ว่าด้วยเรื่องราวเหนือจินตนาการของเด็กหญิงคนหนึ่งในคืนหฤหรรษ์ เมื่อคำเตือนที่ถูกบอกเล่ากลายเป็นเรื่องจริง และเธอได้พบกับประสบการณ์เหลือเชื่อกับเพื่อนตัวยักษ์ต่างวัย ก่อเกิดเป็นมิตรภาพต่างไซส์ ผ่านการถ่ายทอดเรื่องราวจากดิสนีย์\n\nสำหรับคำว่า The BFG ที่ว่านี้ ย่อมาจาก “The Big Friendly” ซึ่งดูจะเป็นการนิยามที่สอดคล้องกับมิตรภาพที่เกิดขึ้นในเรื่องราวนี้อย่างชัดเจน โดยเรื่องราวการผจญภัยทั้งหมดนี้ ถูกถ่ายทอดผ่าน โซฟี เด็กหญิงบ้านเด็กกำพร้าวัย 10 ขวบ ที่ถูกยักษ์แก่ใจดีขนาด 24 ฟุต จับตัวไปยังเมืองยักษ์ ด้วยวัตถุประสงค์อะไรบางอย่าง ทั้งนี้การปรากฏตัวของเธอในสถานที่ไม่สมควรนี้ ได้ชักนำภัยจากเหล่ายักษ์ใจร้ายเข้าใกล้ตัวเธอและเมืองลอนดอนของมนุษย์มากยิ่งขึ้น จึงเป็นหน้าที่สองเพื่อนต่างไซส์ที่ต้องไปเตือนราชินีให้สำเร็จก่อนที่ทุกอย่างจะสายเกินไป…",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/The_BFG_poster.jpg/220px-The_BFG_poster.jpg",
        "trailer": "https://youtu.be/y1fZg0hhBX8",
        "type": "แฟนตาซี / ผจญภัย",
        "time": "117",
        "director": "Steven Spielberg",
        "status": "show now"
    },
    {
        "id": 6,
        "name": "The BFG(6)",
        "detail": "จากวรรณกรรมเยาวชนชื่อดังตั้งแต่ปี 1982 ของ “โรอัลด์ ดาห์ล” ที่ได้รับการตีพิมพ์เป็นภาษาต่างๆ มาแล้วทั่วโลก รวมทั้งไทย ในชื่อ “ยักษ์ใจดี” สู่ภาพยนตร์ผจญภัยแฟนตาซี โดยผู้กำกับ “สตีเว่น สปีลเบิร์ก” ว่าด้วยเรื่องราวเหนือจินตนาการของเด็กหญิงคนหนึ่งในคืนหฤหรรษ์ เมื่อคำเตือนที่ถูกบอกเล่ากลายเป็นเรื่องจริง และเธอได้พบกับประสบการณ์เหลือเชื่อกับเพื่อนตัวยักษ์ต่างวัย ก่อเกิดเป็นมิตรภาพต่างไซส์ ผ่านการถ่ายทอดเรื่องราวจากดิสนีย์\n\nสำหรับคำว่า The BFG ที่ว่านี้ ย่อมาจาก “The Big Friendly” ซึ่งดูจะเป็นการนิยามที่สอดคล้องกับมิตรภาพที่เกิดขึ้นในเรื่องราวนี้อย่างชัดเจน โดยเรื่องราวการผจญภัยทั้งหมดนี้ ถูกถ่ายทอดผ่าน โซฟี เด็กหญิงบ้านเด็กกำพร้าวัย 10 ขวบ ที่ถูกยักษ์แก่ใจดีขนาด 24 ฟุต จับตัวไปยังเมืองยักษ์ ด้วยวัตถุประสงค์อะไรบางอย่าง ทั้งนี้การปรากฏตัวของเธอในสถานที่ไม่สมควรนี้ ได้ชักนำภัยจากเหล่ายักษ์ใจร้ายเข้าใกล้ตัวเธอและเมืองลอนดอนของมนุษย์มากยิ่งขึ้น จึงเป็นหน้าที่สองเพื่อนต่างไซส์ที่ต้องไปเตือนราชินีให้สำเร็จก่อนที่ทุกอย่างจะสายเกินไป…",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/The_BFG_poster.jpg/220px-The_BFG_poster.jpg",
        "trailer": "https://youtu.be/y1fZg0hhBX8",
        "type": "แฟนตาซี / ผจญภัย",
        "time": "117",
        "director": "Steven Spielberg",
        "status": "coming soon"
    },
    {
        "id": 7,
        "name": "The BFG(7)",
        "detail": "จากวรรณกรรมเยาวชนชื่อดังตั้งแต่ปี 1982 ของ “โรอัลด์ ดาห์ล” ที่ได้รับการตีพิมพ์เป็นภาษาต่างๆ มาแล้วทั่วโลก รวมทั้งไทย ในชื่อ “ยักษ์ใจดี” สู่ภาพยนตร์ผจญภัยแฟนตาซี โดยผู้กำกับ “สตีเว่น สปีลเบิร์ก” ว่าด้วยเรื่องราวเหนือจินตนาการของเด็กหญิงคนหนึ่งในคืนหฤหรรษ์ เมื่อคำเตือนที่ถูกบอกเล่ากลายเป็นเรื่องจริง และเธอได้พบกับประสบการณ์เหลือเชื่อกับเพื่อนตัวยักษ์ต่างวัย ก่อเกิดเป็นมิตรภาพต่างไซส์ ผ่านการถ่ายทอดเรื่องราวจากดิสนีย์\n\nสำหรับคำว่า The BFG ที่ว่านี้ ย่อมาจาก “The Big Friendly” ซึ่งดูจะเป็นการนิยามที่สอดคล้องกับมิตรภาพที่เกิดขึ้นในเรื่องราวนี้อย่างชัดเจน โดยเรื่องราวการผจญภัยทั้งหมดนี้ ถูกถ่ายทอดผ่าน โซฟี เด็กหญิงบ้านเด็กกำพร้าวัย 10 ขวบ ที่ถูกยักษ์แก่ใจดีขนาด 24 ฟุต จับตัวไปยังเมืองยักษ์ ด้วยวัตถุประสงค์อะไรบางอย่าง ทั้งนี้การปรากฏตัวของเธอในสถานที่ไม่สมควรนี้ ได้ชักนำภัยจากเหล่ายักษ์ใจร้ายเข้าใกล้ตัวเธอและเมืองลอนดอนของมนุษย์มากยิ่งขึ้น จึงเป็นหน้าที่สองเพื่อนต่างไซส์ที่ต้องไปเตือนราชินีให้สำเร็จก่อนที่ทุกอย่างจะสายเกินไป…",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/The_BFG_poster.jpg/220px-The_BFG_poster.jpg",
        "trailer": "https://youtu.be/y1fZg0hhBX8",
        "type": "แฟนตาซี / ผจญภัย",
        "time": "117",
        "director": "Steven Spielberg",
        "status": "coming soon"
    },
    {
        "id": 8,
        "name": "The BFG(8)",
        "detail": "จากวรรณกรรมเยาวชนชื่อดังตั้งแต่ปี 1982 ของ “โรอัลด์ ดาห์ล” ที่ได้รับการตีพิมพ์เป็นภาษาต่างๆ มาแล้วทั่วโลก รวมทั้งไทย ในชื่อ “ยักษ์ใจดี” สู่ภาพยนตร์ผจญภัยแฟนตาซี โดยผู้กำกับ “สตีเว่น สปีลเบิร์ก” ว่าด้วยเรื่องราวเหนือจินตนาการของเด็กหญิงคนหนึ่งในคืนหฤหรรษ์ เมื่อคำเตือนที่ถูกบอกเล่ากลายเป็นเรื่องจริง และเธอได้พบกับประสบการณ์เหลือเชื่อกับเพื่อนตัวยักษ์ต่างวัย ก่อเกิดเป็นมิตรภาพต่างไซส์ ผ่านการถ่ายทอดเรื่องราวจากดิสนีย์\n\nสำหรับคำว่า The BFG ที่ว่านี้ ย่อมาจาก “The Big Friendly” ซึ่งดูจะเป็นการนิยามที่สอดคล้องกับมิตรภาพที่เกิดขึ้นในเรื่องราวนี้อย่างชัดเจน โดยเรื่องราวการผจญภัยทั้งหมดนี้ ถูกถ่ายทอดผ่าน โซฟี เด็กหญิงบ้านเด็กกำพร้าวัย 10 ขวบ ที่ถูกยักษ์แก่ใจดีขนาด 24 ฟุต จับตัวไปยังเมืองยักษ์ ด้วยวัตถุประสงค์อะไรบางอย่าง ทั้งนี้การปรากฏตัวของเธอในสถานที่ไม่สมควรนี้ ได้ชักนำภัยจากเหล่ายักษ์ใจร้ายเข้าใกล้ตัวเธอและเมืองลอนดอนของมนุษย์มากยิ่งขึ้น จึงเป็นหน้าที่สองเพื่อนต่างไซส์ที่ต้องไปเตือนราชินีให้สำเร็จก่อนที่ทุกอย่างจะสายเกินไป…",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/The_BFG_poster.jpg/220px-The_BFG_poster.jpg",
        "trailer": "https://youtu.be/y1fZg0hhBX8",
        "type": "แฟนตาซี / ผจญภัย",
        "time": "117",
        "director": "Steven Spielberg",
        "status": "coming soon"
    },
    {
        "id": 9,
        "name": "The BFG(9)",
        "detail": "จากวรรณกรรมเยาวชนชื่อดังตั้งแต่ปี 1982 ของ “โรอัลด์ ดาห์ล” ที่ได้รับการตีพิมพ์เป็นภาษาต่างๆ มาแล้วทั่วโลก รวมทั้งไทย ในชื่อ “ยักษ์ใจดี” สู่ภาพยนตร์ผจญภัยแฟนตาซี โดยผู้กำกับ “สตีเว่น สปีลเบิร์ก” ว่าด้วยเรื่องราวเหนือจินตนาการของเด็กหญิงคนหนึ่งในคืนหฤหรรษ์ เมื่อคำเตือนที่ถูกบอกเล่ากลายเป็นเรื่องจริง และเธอได้พบกับประสบการณ์เหลือเชื่อกับเพื่อนตัวยักษ์ต่างวัย ก่อเกิดเป็นมิตรภาพต่างไซส์ ผ่านการถ่ายทอดเรื่องราวจากดิสนีย์\n\nสำหรับคำว่า The BFG ที่ว่านี้ ย่อมาจาก “The Big Friendly” ซึ่งดูจะเป็นการนิยามที่สอดคล้องกับมิตรภาพที่เกิดขึ้นในเรื่องราวนี้อย่างชัดเจน โดยเรื่องราวการผจญภัยทั้งหมดนี้ ถูกถ่ายทอดผ่าน โซฟี เด็กหญิงบ้านเด็กกำพร้าวัย 10 ขวบ ที่ถูกยักษ์แก่ใจดีขนาด 24 ฟุต จับตัวไปยังเมืองยักษ์ ด้วยวัตถุประสงค์อะไรบางอย่าง ทั้งนี้การปรากฏตัวของเธอในสถานที่ไม่สมควรนี้ ได้ชักนำภัยจากเหล่ายักษ์ใจร้ายเข้าใกล้ตัวเธอและเมืองลอนดอนของมนุษย์มากยิ่งขึ้น จึงเป็นหน้าที่สองเพื่อนต่างไซส์ที่ต้องไปเตือนราชินีให้สำเร็จก่อนที่ทุกอย่างจะสายเกินไป…",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/The_BFG_poster.jpg/220px-The_BFG_poster.jpg",
        "trailer": "https://youtu.be/y1fZg0hhBX8",
        "type": "แฟนตาซี / ผจญภัย",
        "time": "117",
        "director": "Steven Spielberg",
        "status": "coming soon"
    },
    {
        "id": 10,
        "name": "The BFG(10)",
        "detail": "จากวรรณกรรมเยาวชนชื่อดังตั้งแต่ปี 1982 ของ “โรอัลด์ ดาห์ล” ที่ได้รับการตีพิมพ์เป็นภาษาต่างๆ มาแล้วทั่วโลก รวมทั้งไทย ในชื่อ “ยักษ์ใจดี” สู่ภาพยนตร์ผจญภัยแฟนตาซี โดยผู้กำกับ “สตีเว่น สปีลเบิร์ก” ว่าด้วยเรื่องราวเหนือจินตนาการของเด็กหญิงคนหนึ่งในคืนหฤหรรษ์ เมื่อคำเตือนที่ถูกบอกเล่ากลายเป็นเรื่องจริง และเธอได้พบกับประสบการณ์เหลือเชื่อกับเพื่อนตัวยักษ์ต่างวัย ก่อเกิดเป็นมิตรภาพต่างไซส์ ผ่านการถ่ายทอดเรื่องราวจากดิสนีย์\n\nสำหรับคำว่า The BFG ที่ว่านี้ ย่อมาจาก “The Big Friendly” ซึ่งดูจะเป็นการนิยามที่สอดคล้องกับมิตรภาพที่เกิดขึ้นในเรื่องราวนี้อย่างชัดเจน โดยเรื่องราวการผจญภัยทั้งหมดนี้ ถูกถ่ายทอดผ่าน โซฟี เด็กหญิงบ้านเด็กกำพร้าวัย 10 ขวบ ที่ถูกยักษ์แก่ใจดีขนาด 24 ฟุต จับตัวไปยังเมืองยักษ์ ด้วยวัตถุประสงค์อะไรบางอย่าง ทั้งนี้การปรากฏตัวของเธอในสถานที่ไม่สมควรนี้ ได้ชักนำภัยจากเหล่ายักษ์ใจร้ายเข้าใกล้ตัวเธอและเมืองลอนดอนของมนุษย์มากยิ่งขึ้น จึงเป็นหน้าที่สองเพื่อนต่างไซส์ที่ต้องไปเตือนราชินีให้สำเร็จก่อนที่ทุกอย่างจะสายเกินไป…",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/The_BFG_poster.jpg/220px-The_BFG_poster.jpg",
        "trailer": "https://youtu.be/y1fZg0hhBX8",
        "type": "แฟนตาซี / ผจญภัย",
        "time": "117",
        "director": "Steven Spielberg",
        "status": "coming soon"
    }
];

exports.findAll = function() {
    return movie;
};

exports.findById = function(id) {
    for (var i = 0; i < movie.length; i++) {
        if (movie[i].id == id) return movie[i];
    }
};